turret1 = """```scss
         [Ветряк]            
            │                   
            ▼                   
[Электрический соеденитель]
            │
            ▼
        [Батарея]
            │
            ▼
       [Выключатель] (опционально)
            │
            ▼
        [Турель 1]```
По желанию замените ветряк на любой другой источник энергии.
"""

turret2 = """```scss
         [Ветряк]            
            │                   
            ▼                   
[Электрический соеденитель]
            │
            ▼
        [Батарея]
            │
            ▼
       [Выключатель] (опционально)
            │
            ▼
    [Разветвитель 2-1]
          ├─ [Турель 1]
          └─ [Турель 2]```
По желанию замените ветряк на любой другой источник энергии.
"""

turret3 = """```scss
         [Ветряк]            
            │                   
            ▼                   
[Электрический соеденитель]
            │
            ▼
        [Батарея]
            │
            ▼
       [Выключатель] (опционально)
            │
            ▼
    [Разветвитель 3-1]
          ├─ [Турель 1]
          ├─ [Турель 2]
          └─ [Турель 3]```
По желанию замените ветряк на любой другой источник энергии.
"""

turret4="""```scss
           [Ветряк]            
              │                   
              ▼                   
 [Электрический соеденитель]
              │
              ▼
          [Батарея]
              │
              ▼
         [Выключатель] (опционально)
              │
              ▼
      [Разветвитель 2-1]
       ├─ [Разветвитель 2-1]
       │    ├─ [Турель 1]
       │    └─ [Турель 2]
       └─ [Разветвитель 2-1]
            ├─ [Турель 3]
            └─ [Турель 4]```
По желанию замените ветряк на любой другой источник энергии.
"""

turret5="""```scss
[Ветряк]            [Ветряк](желательно)
   │                   │
   ▼                   ▼                
 [Электрический соеденитель]
              │
              ▼
          [Батарея]
              │
              ▼
         [Выключатель] (опционально)
              │
              ▼
      [Разветвитель 2-1]
       ├─ [Разветвитель 2-1]
       │    ├─ [Турель 1]
       │    └─ [Турель 2]
       └─ [Разветвитель 3-1]
            ├─ [Турель 3]
            ├─ [Турель 4]
            └─ [Турель 5]```
По желанию замените ветряк на любой другой источник энергии.
"""

turret6="""```scss
[Ветряк]            [Ветряк]
   │                   │
   ▼                   ▼
[Электрический соеденитель]
              │
              ▼
          [Батарея]
              │
              ▼
         [Выключатель] (опционально)
              │
              ▼
      [Разветвитель 2-1]
       ├─ [Разветвитель 3-1]
       │    ├─ [Турель 1]
       │    ├─ [Турель 2]
       │    └─ [Турель 3]
       └─ [Разветвитель 3-1]
            ├─ [Турель 4]
            ├─ [Турель 5]
            └─ [Турель 6]```
По желанию замените ветряк на любой другой источник энергии.            

"""

turret7="""```scss
[Ветряк]            [Ветряк]
   │                   │
   ▼                   ▼
[Электрический соеденитель]
              │
              ▼
          [Батарея]
              │
              ▼
         [Выключатель] (опционально)
              │
              ▼
      [Разветвитель 3-1]
       ├─ [Разветвитель 3-1]
       │    ├─ [Турель 1]
       │    ├─ [Турель 2]
       │    └─ [Турель 3]
       ├─ [Разветвитель 3-1]
       │    ├─ [Турель 4]
       │    ├─ [Турель 5]
       │    └─ [Турель 6]
       └─ [Турель 7]
       ```
По желанию замените ветряк на любой другой источник энергии.            

"""

turret8="""```scss
[Ветряк]            [Ветряк]
   │                   │
   ▼                   ▼
[Электрический соеденитель]
              │
              ▼
          [Батарея]
              │
              ▼
         [Выключатель] (опционально)
              │
              ▼
      [Разветвитель 3-1]
       ├─ [Разветвитель 3-1]
       │    ├─ [Турель 1]
       │    ├─ [Турель 2]
       │    └─ [Турель 3]
       ├─ [Разветвитель 3-1]
       │    ├─ [Турель 4]
       │    ├─ [Турель 5]
       │    └─ [Турель 6]
       └─ [Разветвитель 2-1]
            ├─ [Турель 7]
            └─ [Турель 8]
       ```
По желанию замените ветряк на любой другой источник энергии.            

"""

turret9="""```scss
[Ветряк]            [Ветряк]
   │                   │
   ▼                   ▼
[Электрический соеденитель]
              │
              ▼
          [Батарея]
              │
              ▼
         [Выключатель] (опционально)
              │
              ▼
      [Разветвитель 3-1]
       ├─ [Разветвитель 3-1]
       │    ├─ [Турель 1]
       │    ├─ [Турель 2]
       │    └─ [Турель 3]
       ├─ [Разветвитель 3-1]
       │    ├─ [Турель 4]
       │    ├─ [Турель 5]
       │    └─ [Турель 6]
       └─ [Разветвитель 3-1]
            ├─ [Турель 7]
            ├─ [Турель 8]
            └─ [Турель 9]```
По желанию замените ветряк на любой другой источник энергии.
"""

pvo1="""```scss
         [Ветряк]            
            │                   
            ▼                   
[Электрический соеденитель]
            │
            ▼
        [Батарея]
            │
            ▼
       [Выключатель] (опционально)
            │
            ▼
         [ПВО 1]```
По желанию замените ветряк на любой другой источник энергии.
"""

pvo2="""```scss
[Ветряк]            [Ветряк](желательно)
   │                   │
   ▼                   ▼               
[Электрический соеденитель]
            │
            ▼
        [Батарея]
            │
            ▼
       [Выключатель] (опционально)
            │
            ▼
     [Разветвитель 2-1]
        ├─ [ПВО 1]
        └─ [ПВО 2]```
По желанию замените ветряк на любой другой источник энергии.
"""

pvo3="""```scss
[Ветряк]            [Ветряк]
   │                   │
   ▼                   ▼               
[Электрический соеденитель]
            │
            ▼
        [Батарея]
            │
            ▼
       [Выключатель] (опционально)
            │
            ▼
     [Разветвитель 3-1]
        ├─ [ПВО 1]
        ├─ [ПВО 2]
        └─ [ПВО 3]```
По желанию замените ветряк на любой другой источник энергии.
"""

pvo4="""```scss
[Ветряк]            [Ветряк]
   │                   │
   ▼                   ▼               
[Электрический соеденитель]
            │
            ▼
        [Батарея]
            │
            ▼
       [Выключатель] (опционально)
            │
            ▼
     [Разветвитель 2-1]
       ├─ [Разветвитель 2-1]
       │    ├─ [ПВО 1]
       │    └─ [ПВО 2]
       └─ [Разветвитель 2-1]
            ├─ [ПВО 3]
            └─ [ПВО 4]```
По желанию замените ветряк на любой другой источник энергии.
"""

light="""```scss
         [Ветряк]            
            │                   
            ▼            
[Электрический соеденитель]
            │
            ▼
        [Батарея]
            │
            ▼
       [Выключатель] (опционально)
            │
            ▼
  [Потолочный светильник]
   └─[Потолочный светильник]
      └─[Потолочный светильник]
         └─[Потолочный светильник]
            └─[Потолочный светильник]
               └─...```
По желанию замените ветряк на любой другой источник энергии.
"""

heater="""```scss
         [Ветряк]            
            │                   
            ▼            
[Электрический соеденитель]
            │
            ▼
        [Батарея]
            │
            ▼
       [Выключатель] (опционально)
            │
            ▼
      [Обогреватель]
       └─[Обогреватель]
          └─[Обогреватель]
             └─[Обогреватель]
                └─[Обогреватель]
                   └─...```
По желанию замените ветряк на любой другой источник энергии.
"""

farm ="""```scss
[Ветряк]          [Ветряк](опционально)
    │                │
    ▼                ▼
[Электрический соединитель]
             │
             ▼
         [Батарея] 
             │
             ▼
       [Выключатель](опционально)
             │
             ▼
     [Разветвитель 2-1]───────────────
             │                        │
             ▼                        ▼
   [Разветвитель 2-1]         [Разветвитель 2-1]
        ├─ [Система света]     ├─ [Разветвитель 2-1](3-1 при надобности)
        └─ [Система обогрева]  │   ├─ [Насос] ══[Соеденитель жидкости]═╦
                               │   └─ [Насос] ═══════════╩             ║
                               └─ [Циркулярный насос]                  ║  
                           ╦══════════╩         ╩════[бочка]═══════════╩
                           ║      (выход)      (вход)
                   [разбрызгиватель]
                    ║═[разбрызгиватель]
                       ║═[разбрызгиватель]
                          ║═...```
По желанию замените ветряк на любой другой источник энергии.
При надобности добавьте 3+ насос и 2+ циркулярный насос.


"""